# DBeam_SetLShutDepth

## Description
```pascal
PROCEDURE DBeam_SetLShutDepth(depth : INTEGER);
```

```python

def vs.DBeam_SetLShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight